labels_dict = {
    0: "A",
    1: "B",
    2: "C",
    3: "D",
    4: "E",
    5: "F",
    6: "G",
    7: "H",
    8: "I",
    9: "J",
    10: "K",
    11: "L",
    12: "M",
    13: "N",
    14: "O",
    15: "P",
    16: "Q",
    17: "R",
    18: "S",
    19: "T",
    20: "U",
    21: "V",
    22: "W",
    23: "X",
    24: "Y",
    25: "Z",
    26: "0",
    27: "1",
    28: "2",
    29: "3",
    30: "4",
    31: "5",
    32: "6",
    33: "7",
    34: "8",
    35: "9",
}
labels_dict2 = {
    0: "A",  # 文件夹 '0'
    1: "B",  # 文件夹 '1'
    2: "K",  # 文件夹 '10'
    3: "L",  # 文件夹 '11'
    4: "M",  # 文件夹 '12'
    5: "N",  # 文件夹 '13'
    6: "O",  # 文件夹 '14'
    7: "P",  # 文件夹 '15'
    8: "Q",  # 文件夹 '16'
    9: "R",  # 文件夹 '17'
    10: "S", # 文件夹 '18'
    11: "T", # 文件夹 '19'
    12: "C", # 文件夹 '2'
    13: "U", # 文件夹 '20'
    14: "V", # 文件夹 '21'
    15: "W", # 文件夹 '22'
    16: "X", # 文件夹 '23'
    17: "Y", # 文件夹 '24'
    18: "Z", # 文件夹 '25'
    19: "0", # 文件夹 '26'
    20: "1", # 文件夹 '27'
    21: "2", # 文件夹 '28'
    22: "3", # 文件夹 '29'
    23: "D", # 文件夹 '3'
    24: "4", # 文件夹 '30'
    25: "5", # 文件夹 '31'
    26: "6", # 文件夹 '32'
    27: "7", # 文件夹 '33'
    28: "8", # 文件夹 '34'
    29: "9", # 文件夹 '35'
    30: "E", # 文件夹 '4'
    31: "F", # 文件夹 '5'
    32: "G", # 文件夹 '6'
    33: "H", # 文件夹 '7'
    34: "I", # 文件夹 '8'
    35: "J", # 文件夹 '9'
}



models_dict = {
    "svm": "./models/svm_model.p",
    "random_forest": "./models/random_forest_model.p",
    "knn": "./models/knn_model.p",
    "softmax": "./models/softmax_model.p",
    "cnn_sklearn": "./models/cnn_sklearn.p",
    "cnn_tensorflow": "./models/cnn_tensorflow.h5",
}
